Tekla.Structures.ModelInternal.dotView_t
Struct for ModelView

Tekla.Structures.ModelInternal.dotView_t.Identifier
Internal number of the View.

Tekla.Structures.ModelInternal.dotView_t.ModifyType
Tells how the View is modified.

Tekla.Structures.ModelInternal.dotView_t.aName
Defines the View Name.

Tekla.Structures.ModelInternal.dotView_t.ViewCoordinateSystem
View Plane Coordinate System

Tekla.Structures.ModelInternal.dotView_t.DisplayCoordinateSystem
Display Plane Coordinate System

Tekla.Structures.ModelInternal.dotView_t.MinPoint
MinPoint of Work Area

Tekla.Structures.ModelInternal.dotView_t.MaxPoint
MaxPoint of Work Area

Tekla.Structures.ModelInternal.dotView_t.aRepresentation
Defines the representation filter.

Tekla.Structures.ModelInternal.dotView_t.ViewDepthUp
View Depth Up

Tekla.Structures.ModelInternal.dotView_t.ViewDepthDown
View Depth Down

Tekla.Structures.ModelInternal.dotView_t.DisplayOrientationType
Display angle type

Tekla.Structures.ModelInternal.dotView_t.ViewProjectionType
View projection

Tekla.Structures.ModelInternal.dotView_t.ViewRenderingType
The view rendering type.

Tekla.Structures.ModelInternal.dotView_t.ZoomMinPoint
MinPoint of Zoom Area

Tekla.Structures.ModelInternal.dotView_t.ZoomMaxPoint
MaxPoint of Zoom Area

Tekla.Structures.ModelInternal.dotView_t.aViewFilter
Defines the View Filter.

Tekla.Structures.ModelInternal.dotView_t.SharedView
Tells if View is shared if model is shared.

Tekla.Structures.ModelInternal.dotView_t.VisibilitySettings
